Tekla Open API Reference for Tekla Structures 2025
BoltGroup.ExtraLength Property
 The extra length for the bolts.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double ExtraLength { get; set; }
Public Property ExtraLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace